automatedtesting/jmeter/endurancereport/statistics.json
{
  "authors POST" : {
    "transaction" : "authors POST",
    "sampleCount" : 1157,
    "errorCount" : 1157,
    "errorPct" : 100.0,
    "meanResTime" : 40.38807260155577,
    "medianResTime" : 25.0,
    "minResTime" : 2.0,
    "maxResTime" : 813.0,
    "pct1ResTime" : 85.20000000000005,
    "pct2ResTime" : 119.0,
    "pct3ResTime" : 282.0400000000045,
    "throughput" : 22.0561602836609,
    "receivedKBytesPerSec" : 6.117138203671579,
    "sentKBytesPerSec" : 6.423099365909221
  },
  "activities DELETE " : {
    "transaction" : "activities DELETE ",
    "sampleCount" : 1163,
    "errorCount" : 1163,
    "errorPct" : 100.0,
    "meanResTime" : 48.17024935511599,
    "medianResTime" : 22.0,
    "minResTime" : 2.0,
    "maxResTime" : 826.0,
    "pct1ResTime" : 92.0,
    "pct2ResTime" : 137.5999999999999,
    "pct3ResTime" : 811.3599999999999,
    "throughput" : 22.08968831316834,
    "receivedKBytesPerSec" : 6.255868760565253,
    "sentKBytesPerSec" : 4.640123298875572
  },
  "users DELETE" : {
    "transaction" : "users DELETE",
    "sampleCount" : 1143,
    "errorCount" : 1143,
    "errorPct" : 100.0,
    "meanResTime" : 34.329833770778656,
    "medianResTime" : 19.0,
    "minResTime" : 2.0,
    "maxResTime" : 605.0,
    "pct1ResTime" : 74.0,
    "pct2ResTime" : 104.0,
    "pct3ResTime" : 275.6799999999985,
    "throughput" : 22.59965200885796,
    "receivedKBytesPerSec" : 6.400292072821101,
    "sentKBytesPerSec" : 4.636856846626858
  },
  "coverPhotos all GET" : {
    "transaction" : "coverPhotos all GET",
    "sampleCount" : 1153,
    "errorCount" : 1153,
    "errorPct" : 100.0,
    "meanResTime" : 107.6435385949698,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 5889.0,
    "pct1ResTime" : 104.60000000000014,
    "pct2ResTime" : 192.29999999999995,
    "pct3ResTime" : 5862.84,
    "throughput" : 22.14029225953876,
    "receivedKBytesPerSec" : 6.140471681356453,
    "sentKBytesPerSec" : 4.151304798663517
  },
  "coverPhotosCoverPhotosForBook  GET" : {
    "transaction" : "coverPhotosCoverPhotosForBook  GET",
    "sampleCount" : 1149,
    "errorCount" : 1149,
    "errorPct" : 100.0,
    "meanResTime" : 79.83550913838133,
    "medianResTime" : 23.0,
    "minResTime" : 2.0,
    "maxResTime" : 5892.0,
    "pct1ResTime" : 90.0,
    "pct2ResTime" : 147.5,
    "pct3ResTime" : 502.5,
    "throughput" : 22.13020030816641,
    "receivedKBytesPerSec" : 6.137672741718028,
    "sentKBytesPerSec" : 4.129926449345146
  },
  "authors all GET" : {
    "transaction" : "authors all GET",
    "sampleCount" : 1158,
    "errorCount" : 1158,
    "errorPct" : 100.0,
    "meanResTime" : 39.31692573402418,
    "medianResTime" : 22.0,
    "minResTime" : 2.0,
    "maxResTime" : 5536.0,
    "pct1ResTime" : 70.0,
    "pct2ResTime" : 105.04999999999995,
    "pct3ResTime" : 245.25000000000205,
    "throughput" : 22.05336228075187,
    "receivedKBytesPerSec" : 6.116362195052277,
    "sentKBytesPerSec" : 4.048859481231789
  },
  "authors DELETE" : {
    "transaction" : "authors DELETE",
    "sampleCount" : 1156,
    "errorCount" : 1156,
    "errorPct" : 100.0,
    "meanResTime" : 41.72837370242222,
    "medianResTime" : 25.0,
    "minResTime" : 2.0,
    "maxResTime" : 5518.0,
    "pct1ResTime" : 83.0,
    "pct2ResTime" : 113.0,
    "pct3ResTime" : 176.88000000000102,
    "throughput" : 22.072863362101884,
    "receivedKBytesPerSec" : 6.2511038818452604,
    "sentKBytesPerSec" : 4.571898211353395
  },
  "users all GET" : {
    "transaction" : "users all GET",
    "sampleCount" : 1146,
    "errorCount" : 1146,
    "errorPct" : 100.0,
    "meanResTime" : 49.43455497382208,
    "medianResTime" : 23.0,
    "minResTime" : 2.0,
    "maxResTime" : 1054.0,
    "pct1ResTime" : 92.29999999999995,
    "pct2ResTime" : 141.64999999999986,
    "pct3ResTime" : 547.53,
    "throughput" : 22.16334345446458,
    "receivedKBytesPerSec" : 6.146864786199161,
    "sentKBytesPerSec" : 4.025763557158605
  },
  "books PUT" : {
    "transaction" : "books PUT",
    "sampleCount" : 1154,
    "errorCount" : 1154,
    "errorPct" : 100.0,
    "meanResTime" : 55.519064124783306,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 5890.0,
    "pct1ResTime" : 76.0,
    "pct2ResTime" : 106.25,
    "pct3ResTime" : 211.70000000000027,
    "throughput" : 22.09754322807958,
    "receivedKBytesPerSec" : 6.258093297014725,
    "sentKBytesPerSec" : 8.463441934109492
  },
  "books POST" : {
    "transaction" : "books POST",
    "sampleCount" : 1153,
    "errorCount" : 1153,
    "errorPct" : 100.0,
    "meanResTime" : 88.68950563746752,
    "medianResTime" : 26.0,
    "minResTime" : 2.0,
    "maxResTime" : 5885.0,
    "pct1ResTime" : 80.0,
    "pct2ResTime" : 114.29999999999995,
    "pct3ResTime" : 517.5400000000018,
    "throughput" : 22.09362484910035,
    "receivedKBytesPerSec" : 6.127528766742675,
    "sentKBytesPerSec" : 8.567690618592753
  },
  "activities GET" : {
    "transaction" : "activities GET",
    "sampleCount" : 1166,
    "errorCount" : 1166,
    "errorPct" : 100.0,
    "meanResTime" : 88.65351629502571,
    "medianResTime" : 26.0,
    "minResTime" : 2.0,
    "maxResTime" : 1182.0,
    "pct1ResTime" : 142.29999999999995,
    "pct2ResTime" : 235.44999999999823,
    "pct3ResTime" : 1156.33,
    "throughput" : 21.649120852596596,
    "receivedKBytesPerSec" : 6.004248361462337,
    "sentKBytesPerSec" : 4.082455172301751
  },
  "activities PUT " : {
    "transaction" : "activities PUT ",
    "sampleCount" : 1164,
    "errorCount" : 1164,
    "errorPct" : 100.0,
    "meanResTime" : 49.25429553264595,
    "medianResTime" : 23.0,
    "minResTime" : 2.0,
    "maxResTime" : 5481.0,
    "pct1ResTime" : 103.5,
    "pct2ResTime" : 155.0,
    "pct3ResTime" : 317.6499999999983,
    "throughput" : 22.096930349108717,
    "receivedKBytesPerSec" : 6.25791972777493,
    "sentKBytesPerSec" : 6.978666863621695
  },
  "authors PUT" : {
    "transaction" : "authors PUT",
    "sampleCount" : 1157,
    "errorCount" : 1157,
    "errorPct" : 100.0,
    "meanResTime" : 37.88159031979251,
    "medianResTime" : 25.0,
    "minResTime" : 2.0,
    "maxResTime" : 470.0,
    "pct1ResTime" : 81.0,
    "pct2ResTime" : 113.09999999999991,
    "pct3ResTime" : 174.0,
    "throughput" : 22.080152671755727,
    "receivedKBytesPerSec" : 6.253168237118321,
    "sentKBytesPerSec" : 6.324397662213741
  },
  "books GET" : {
    "transaction" : "books GET",
    "sampleCount" : 1155,
    "errorCount" : 1155,
    "errorPct" : 100.0,
    "meanResTime" : 54.31341991341986,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 5536.0,
    "pct1ResTime" : 76.0,
    "pct2ResTime" : 108.0,
    "pct3ResTime" : 212.32000000000016,
    "throughput" : 22.101033295063147,
    "receivedKBytesPerSec" : 6.12958345292767,
    "sentKBytesPerSec" : 4.059741855625718
  },
  "books DELETE" : {
    "transaction" : "books DELETE",
    "sampleCount" : 1153,
    "errorCount" : 1153,
    "errorPct" : 100.0,
    "meanResTime" : 95.22029488291417,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 5900.0,
    "pct1ResTime" : 80.60000000000014,
    "pct2ResTime" : 144.0,
    "pct3ResTime" : 3142.4600000001838,
    "throughput" : 22.119904076738607,
    "receivedKBytesPerSec" : 6.2644259592326135,
    "sentKBytesPerSec" : 4.538425509592326
  },
  "coverPhotos POST" : {
    "transaction" : "coverPhotos POST",
    "sampleCount" : 1149,
    "errorCount" : 1149,
    "errorPct" : 100.0,
    "meanResTime" : 46.73194081810274,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 1076.0,
    "pct1ResTime" : 82.0,
    "pct2ResTime" : 121.5,
    "pct3ResTime" : 537.5,
    "throughput" : 22.187035356363566,
    "receivedKBytesPerSec" : 6.153435587116458,
    "sentKBytesPerSec" : 6.203237691167668
  },
  "users PUT" : {
    "transaction" : "users PUT",
    "sampleCount" : 1143,
    "errorCount" : 1143,
    "errorPct" : 100.0,
    "meanResTime" : 36.54855643044624,
    "medianResTime" : 23.0,
    "minResTime" : 2.0,
    "maxResTime" : 606.0,
    "pct1ResTime" : 79.0,
    "pct2ResTime" : 103.79999999999995,
    "pct3ResTime" : 249.2799999999993,
    "throughput" : 22.581346188039593,
    "receivedKBytesPerSec" : 6.3951078071596505,
    "sentKBytesPerSec" : 6.267116902424087
  },
  "users POST" : {
    "transaction" : "users POST",
    "sampleCount" : 1145,
    "errorCount" : 1145,
    "errorPct" : 100.0,
    "meanResTime" : 42.314410480349395,
    "medianResTime" : 22.0,
    "minResTime" : 2.0,
    "maxResTime" : 1038.0,
    "pct1ResTime" : 88.0,
    "pct2ResTime" : 116.70000000000005,
    "pct3ResTime" : 383.119999999999,
    "throughput" : 22.167583055835205,
    "receivedKBytesPerSec" : 6.148040613141795,
    "sentKBytesPerSec" : 6.171806180060791
  },
  "authors GET" : {
    "transaction" : "authors GET",
    "sampleCount" : 1162,
    "errorCount" : 1162,
    "errorPct" : 100.0,
    "meanResTime" : 37.045611015490465,
    "medianResTime" : 22.0,
    "minResTime" : 2.0,
    "maxResTime" : 812.0,
    "pct1ResTime" : 75.0,
    "pct2ResTime" : 112.84999999999991,
    "pct3ResTime" : 265.3699999999999,
    "throughput" : 22.106805167132773,
    "receivedKBytesPerSec" : 6.13118424557198,
    "sentKBytesPerSec" : 4.10398518801248
  },
  "users GET" : {
    "transaction" : "users GET",
    "sampleCount" : 1145,
    "errorCount" : 1145,
    "errorPct" : 100.0,
    "meanResTime" : 48.247161572052406,
    "medianResTime" : 23.0,
    "minResTime" : 2.0,
    "maxResTime" : 1045.0,
    "pct1ResTime" : 93.0,
    "pct2ResTime" : 127.70000000000005,
    "pct3ResTime" : 522.2599999999993,
    "throughput" : 22.154286709362847,
    "receivedKBytesPerSec" : 6.144352954549852,
    "sentKBytesPerSec" : 4.069504842017685
  },
  "activities POST" : {
    "transaction" : "activities POST",
    "sampleCount" : 1165,
    "errorCount" : 1165,
    "errorPct" : 100.0,
    "meanResTime" : 43.994849785407744,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 345.0,
    "pct1ResTime" : 126.0,
    "pct2ResTime" : 163.0,
    "pct3ResTime" : 197.33999999999992,
    "throughput" : 22.063140351873944,
    "receivedKBytesPerSec" : 6.11907408196504,
    "sentKBytesPerSec" : 6.944296488835862
  },
  "coverPhotos GET" : {
    "transaction" : "coverPhotos GET",
    "sampleCount" : 1152,
    "errorCount" : 1152,
    "errorPct" : 100.0,
    "meanResTime" : 61.84201388888876,
    "medianResTime" : 23.0,
    "minResTime" : 2.0,
    "maxResTime" : 5881.0,
    "pct1ResTime" : 96.0,
    "pct2ResTime" : 146.69999999999982,
    "pct3ResTime" : 341.94000000000005,
    "throughput" : 22.15086430672794,
    "receivedKBytesPerSec" : 6.143403772569077,
    "sentKBytesPerSec" : 4.198672324158286
  },
  "books all GET" : {
    "transaction" : "books all GET",
    "sampleCount" : 1155,
    "errorCount" : 1155,
    "errorPct" : 100.0,
    "meanResTime" : 41.489177489177486,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 5535.0,
    "pct1ResTime" : 73.40000000000009,
    "pct2ResTime" : 107.0,
    "pct3ResTime" : 247.7200000000007,
    "throughput" : 22.077375946173255,
    "receivedKBytesPerSec" : 6.123022235071488,
    "sentKBytesPerSec" : 4.010148365222876
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 31194,
    "errorCount" : 31194,
    "errorPct" : 100.0,
    "meanResTime" : 189.1508944027688,
    "medianResTime" : 20.0,
    "minResTime" : 2.0,
    "maxResTime" : 64848.0,
    "pct1ResTime" : 69.0,
    "pct2ResTime" : 176.0,
    "pct3ResTime" : 775.0,
    "throughput" : 262.17190691107135,
    "receivedKBytesPerSec" : 73.27954019691889,
    "sentKBytesPerSec" : 61.70631879921921
  },
  "coverPhotos DELETE" : {
    "transaction" : "coverPhotos DELETE",
    "sampleCount" : 1148,
    "errorCount" : 1148,
    "errorPct" : 100.0,
    "meanResTime" : 56.053135888501714,
    "medianResTime" : 23.0,
    "minResTime" : 2.0,
    "maxResTime" : 1049.0,
    "pct1ResTime" : 87.0,
    "pct2ResTime" : 140.84999999999968,
    "pct3ResTime" : 1017.51,
    "throughput" : 22.185289684226802,
    "receivedKBytesPerSec" : 6.282943367603293,
    "sentKBytesPerSec" : 4.68184210494531
  },
  "coverPhotos PUT" : {
    "transaction" : "coverPhotos PUT",
    "sampleCount" : 1149,
    "errorCount" : 1149,
    "errorPct" : 100.0,
    "meanResTime" : 60.64664926022628,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 5877.0,
    "pct1ResTime" : 77.0,
    "pct2ResTime" : 110.5,
    "pct3ResTime" : 466.0,
    "throughput" : 22.152813927931057,
    "receivedKBytesPerSec" : 6.2737461319336,
    "sentKBytesPerSec" : 6.1308965418763375
  },
  "activities all GET" : {
    "transaction" : "activities all GET",
    "sampleCount" : 1192,
    "errorCount" : 1192,
    "errorPct" : 100.0,
    "meanResTime" : 3565.514261744967,
    "medianResTime" : 732.0,
    "minResTime" : 62.0,
    "maxResTime" : 64848.0,
    "pct1ResTime" : 976.7,
    "pct2ResTime" : 6213.0,
    "pct3ResTime" : 64761.49,
    "throughput" : 10.018237899531867,
    "receivedKBytesPerSec" : 2.778495667448291,
    "sentKBytesPerSec" : 1.868636170713463
  },
  "authorsAuthorsForBook GET " : {
    "transaction" : "authorsAuthorsForBook GET ",
    "sampleCount" : 1162,
    "errorCount" : 1162,
    "errorPct" : 100.0,
    "meanResTime" : 44.74096385542172,
    "medianResTime" : 22.0,
    "minResTime" : 2.0,
    "maxResTime" : 827.0,
    "pct1ResTime" : 81.0,
    "pct2ResTime" : 129.0,
    "pct3ResTime" : 812.3699999999999,
    "throughput" : 22.09335488164274,
    "receivedKBytesPerSec" : 6.127453892955605,
    "sentKBytesPerSec" : 4.144639313385303
  }
}