automatedtesting/jmeter/stressreport/statistics.json
{
  "authors POST" : {
    "transaction" : "authors POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 77.04000000000002,
    "medianResTime" : 69.5,
    "minResTime" : 4.0,
    "maxResTime" : 268.0,
    "pct1ResTime" : 124.80000000000001,
    "pct2ResTime" : 252.89999999999998,
    "pct3ResTime" : 267.98,
    "throughput" : 30.441400304414003,
    "receivedKBytesPerSec" : 8.442732115677321,
    "sentKBytesPerSec" : 8.864868721461187
  },
  "activities DELETE " : {
    "transaction" : "activities DELETE ",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 96.66999999999999,
    "medianResTime" : 79.5,
    "minResTime" : 5.0,
    "maxResTime" : 494.0,
    "pct1ResTime" : 153.60000000000002,
    "pct2ResTime" : 220.59999999999945,
    "pct3ResTime" : 492.8999999999994,
    "throughput" : 28.28854314002829,
    "receivedKBytesPerSec" : 8.011403818953324,
    "sentKBytesPerSec" : 5.942251591230551
  },
  "users DELETE" : {
    "transaction" : "users DELETE",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 57.929999999999986,
    "medianResTime" : 47.5,
    "minResTime" : 4.0,
    "maxResTime" : 156.0,
    "pct1ResTime" : 117.40000000000003,
    "pct2ResTime" : 126.79999999999995,
    "pct3ResTime" : 155.98,
    "throughput" : 60.16847172081829,
    "receivedKBytesPerSec" : 17.039899217809868,
    "sentKBytesPerSec" : 12.345113191937426
  },
  "coverPhotos all GET" : {
    "transaction" : "coverPhotos all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 74.33999999999997,
    "medianResTime" : 46.5,
    "minResTime" : 11.0,
    "maxResTime" : 457.0,
    "pct1ResTime" : 209.70000000000002,
    "pct2ResTime" : 289.9,
    "pct3ResTime" : 456.5599999999998,
    "throughput" : 36.54970760233918,
    "receivedKBytesPerSec" : 10.136832967836256,
    "sentKBytesPerSec" : 6.853070175438596
  },
  "coverPhotosCoverPhotosForBook  GET" : {
    "transaction" : "coverPhotosCoverPhotosForBook  GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 69.90999999999997,
    "medianResTime" : 48.0,
    "minResTime" : 4.0,
    "maxResTime" : 344.0,
    "pct1ResTime" : 170.00000000000034,
    "pct2ResTime" : 260.54999999999967,
    "pct3ResTime" : 343.2999999999996,
    "throughput" : 39.635354736424894,
    "receivedKBytesPerSec" : 10.99261791518034,
    "sentKBytesPerSec" : 7.3967932520808555
  },
  "authors all GET" : {
    "transaction" : "authors all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 62.94999999999999,
    "medianResTime" : 54.0,
    "minResTime" : 4.0,
    "maxResTime" : 404.0,
    "pct1ResTime" : 102.9,
    "pct2ResTime" : 152.5499999999999,
    "pct3ResTime" : 403.6299999999998,
    "throughput" : 30.084235860409144,
    "receivedKBytesPerSec" : 8.343674789410349,
    "sentKBytesPerSec" : 5.523277677496992
  },
  "authors DELETE" : {
    "transaction" : "authors DELETE",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 129.84000000000003,
    "medianResTime" : 113.0,
    "minResTime" : 44.0,
    "maxResTime" : 783.0,
    "pct1ResTime" : 263.9,
    "pct2ResTime" : 270.84999999999997,
    "pct3ResTime" : 779.3799999999982,
    "throughput" : 30.712530712530715,
    "receivedKBytesPerSec" : 8.697884674447176,
    "sentKBytesPerSec" : 6.36145289465602
  },
  "users all GET" : {
    "transaction" : "users all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 67.71000000000002,
    "medianResTime" : 51.5,
    "minResTime" : 6.0,
    "maxResTime" : 348.0,
    "pct1ResTime" : 107.80000000000001,
    "pct2ResTime" : 191.74999999999926,
    "pct3ResTime" : 347.15999999999957,
    "throughput" : 44.9034575662326,
    "receivedKBytesPerSec" : 12.453693309384823,
    "sentKBytesPerSec" : 8.15629209699147
  },
  "books PUT" : {
    "transaction" : "books PUT",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 146.31,
    "medianResTime" : 71.5,
    "minResTime" : 13.0,
    "maxResTime" : 769.0,
    "pct1ResTime" : 360.5000000000001,
    "pct2ResTime" : 381.95,
    "pct3ResTime" : 768.7899999999998,
    "throughput" : 34.494653328734046,
    "receivedKBytesPerSec" : 9.768993618489134,
    "sentKBytesPerSec" : 13.21172171438427
  },
  "books POST" : {
    "transaction" : "books POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 126.61999999999999,
    "medianResTime" : 54.5,
    "minResTime" : 4.0,
    "maxResTime" : 744.0,
    "pct1ResTime" : 350.10000000000014,
    "pct2ResTime" : 411.95,
    "pct3ResTime" : 743.96,
    "throughput" : 35.536602700781806,
    "receivedKBytesPerSec" : 9.855854655294953,
    "sentKBytesPerSec" : 13.780844660625444
  },
  "activities GET" : {
    "transaction" : "activities GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 80.08999999999997,
    "medianResTime" : 47.5,
    "minResTime" : 4.0,
    "maxResTime" : 422.0,
    "pct1ResTime" : 193.0,
    "pct2ResTime" : 292.9999999999993,
    "pct3ResTime" : 421.16999999999956,
    "throughput" : 27.870680044593087,
    "receivedKBytesPerSec" : 7.729758918617614,
    "sentKBytesPerSec" : 5.255691715440356
  },
  "activities PUT " : {
    "transaction" : "activities PUT ",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 98.14,
    "medianResTime" : 81.5,
    "minResTime" : 24.0,
    "maxResTime" : 376.0,
    "pct1ResTime" : 142.9,
    "pct2ResTime" : 263.14999999999867,
    "pct3ResTime" : 375.8099999999999,
    "throughput" : 28.169014084507044,
    "receivedKBytesPerSec" : 7.977552816901409,
    "sentKBytesPerSec" : 8.896346830985916
  },
  "authors PUT" : {
    "transaction" : "authors PUT",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 119.09,
    "medianResTime" : 87.0,
    "minResTime" : 13.0,
    "maxResTime" : 276.0,
    "pct1ResTime" : 260.9,
    "pct2ResTime" : 265.9,
    "pct3ResTime" : 275.99,
    "throughput" : 30.349013657056148,
    "receivedKBytesPerSec" : 8.594935508345978,
    "sentKBytesPerSec" : 8.692739946889226
  },
  "books GET" : {
    "transaction" : "books GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 93.11,
    "medianResTime" : 91.0,
    "minResTime" : 15.0,
    "maxResTime" : 332.0,
    "pct1ResTime" : 149.3000000000001,
    "pct2ResTime" : 193.6499999999997,
    "pct3ResTime" : 331.87999999999994,
    "throughput" : 33.9097999321804,
    "receivedKBytesPerSec" : 9.404671074940659,
    "sentKBytesPerSec" : 6.228938835198373
  },
  "books DELETE" : {
    "transaction" : "books DELETE",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 86.15999999999997,
    "medianResTime" : 49.0,
    "minResTime" : 7.0,
    "maxResTime" : 411.0,
    "pct1ResTime" : 294.0000000000001,
    "pct2ResTime" : 355.69999999999993,
    "pct3ResTime" : 410.8599999999999,
    "throughput" : 35.549235691432635,
    "receivedKBytesPerSec" : 10.067654639175258,
    "sentKBytesPerSec" : 7.2938422058300745
  },
  "coverPhotos POST" : {
    "transaction" : "coverPhotos POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 100.74999999999999,
    "medianResTime" : 68.5,
    "minResTime" : 33.0,
    "maxResTime" : 290.0,
    "pct1ResTime" : 226.80000000000007,
    "pct2ResTime" : 267.79999999999995,
    "pct3ResTime" : 289.9,
    "throughput" : 41.10152075626798,
    "receivedKBytesPerSec" : 11.399249897246198,
    "sentKBytesPerSec" : 11.491567766132349
  },
  "users PUT" : {
    "transaction" : "users PUT",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 65.89999999999998,
    "medianResTime" : 52.5,
    "minResTime" : 5.0,
    "maxResTime" : 158.0,
    "pct1ResTime" : 120.0,
    "pct2ResTime" : 124.89999999999998,
    "pct3ResTime" : 157.71999999999986,
    "throughput" : 56.022408963585434,
    "receivedKBytesPerSec" : 15.865721288515408,
    "sentKBytesPerSec" : 15.548406862745098
  },
  "users POST" : {
    "transaction" : "users POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 76.75999999999999,
    "medianResTime" : 74.0,
    "minResTime" : 11.0,
    "maxResTime" : 357.0,
    "pct1ResTime" : 112.0,
    "pct2ResTime" : 121.84999999999997,
    "pct3ResTime" : 354.979999999999,
    "throughput" : 49.82561036372696,
    "receivedKBytesPerSec" : 13.818821624314896,
    "sentKBytesPerSec" : 13.872345229197807
  },
  "authors GET" : {
    "transaction" : "authors GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 131.18999999999988,
    "medianResTime" : 77.0,
    "minResTime" : 5.0,
    "maxResTime" : 564.0,
    "pct1ResTime" : 273.9,
    "pct2ResTime" : 489.74999999999994,
    "pct3ResTime" : 563.99,
    "throughput" : 28.75215641173088,
    "receivedKBytesPerSec" : 7.974230879815986,
    "sentKBytesPerSec" : 5.337680599482461
  },
  "users GET" : {
    "transaction" : "users GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 72.59,
    "medianResTime" : 60.0,
    "minResTime" : 3.0,
    "maxResTime" : 411.0,
    "pct1ResTime" : 118.70000000000002,
    "pct2ResTime" : 129.69999999999993,
    "pct3ResTime" : 410.3499999999997,
    "throughput" : 50.02501250625313,
    "receivedKBytesPerSec" : 13.874124562281139,
    "sentKBytesPerSec" : 9.189164894947472
  },
  "activities POST" : {
    "transaction" : "activities POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 70.65,
    "medianResTime" : 69.0,
    "minResTime" : 4.0,
    "maxResTime" : 287.0,
    "pct1ResTime" : 127.50000000000003,
    "pct2ResTime" : 155.0999999999998,
    "pct3ResTime" : 286.5799999999998,
    "throughput" : 27.739251040221916,
    "receivedKBytesPerSec" : 7.693307905686546,
    "sentKBytesPerSec" : 8.73082090846047
  },
  "coverPhotos GET" : {
    "transaction" : "coverPhotos GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 86.75000000000001,
    "medianResTime" : 49.0,
    "minResTime" : 3.0,
    "maxResTime" : 485.0,
    "pct1ResTime" : 238.00000000000006,
    "pct2ResTime" : 299.79999999999995,
    "pct3ResTime" : 483.86999999999944,
    "throughput" : 37.18854592785422,
    "receivedKBytesPerSec" : 10.314010784678318,
    "sentKBytesPerSec" : 7.049117934176274
  },
  "books all GET" : {
    "transaction" : "books all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 92.79999999999998,
    "medianResTime" : 92.5,
    "minResTime" : 10.0,
    "maxResTime" : 379.0,
    "pct1ResTime" : 128.8,
    "pct2ResTime" : 147.24999999999983,
    "pct3ResTime" : 379.0,
    "throughput" : 32.97065611605671,
    "receivedKBytesPerSec" : 9.144205407187604,
    "sentKBytesPerSec" : 5.988810583580613
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2700,
    "errorCount" : 2700,
    "errorPct" : 100.0,
    "meanResTime" : 173.24370370370343,
    "medianResTime" : 66.0,
    "minResTime" : 3.0,
    "maxResTime" : 3503.0,
    "pct1ResTime" : 263.0,
    "pct2ResTime" : 379.0,
    "pct3ResTime" : 3131.169999999982,
    "throughput" : 329.54961552544853,
    "receivedKBytesPerSec" : 92.11369461735629,
    "sentKBytesPerSec" : 77.58028004088857
  },
  "coverPhotos DELETE" : {
    "transaction" : "coverPhotos DELETE",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 94.87999999999998,
    "medianResTime" : 80.0,
    "minResTime" : 11.0,
    "maxResTime" : 291.0,
    "pct1ResTime" : 206.70000000000002,
    "pct2ResTime" : 221.84999999999997,
    "pct3ResTime" : 290.86999999999995,
    "throughput" : 41.631973355537056,
    "receivedKBytesPerSec" : 11.790304954204828,
    "sentKBytesPerSec" : 8.785810002081599
  },
  "coverPhotos PUT" : {
    "transaction" : "coverPhotos PUT",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 85.37000000000002,
    "medianResTime" : 55.0,
    "minResTime" : 4.0,
    "maxResTime" : 283.0,
    "pct1ResTime" : 219.70000000000013,
    "pct2ResTime" : 275.79999999999995,
    "pct3ResTime" : 282.99,
    "throughput" : 39.57261574990107,
    "receivedKBytesPerSec" : 11.2070884447962,
    "sentKBytesPerSec" : 10.952030569845666
  },
  "activities all GET" : {
    "transaction" : "activities all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 2301.509999999999,
    "medianResTime" : 2176.5,
    "minResTime" : 719.0,
    "maxResTime" : 3503.0,
    "pct1ResTime" : 3499.0,
    "pct2ResTime" : 3501.0,
    "pct3ResTime" : 3503.0,
    "throughput" : 14.088475626937164,
    "receivedKBytesPerSec" : 3.9073506621583545,
    "sentKBytesPerSec" : 2.627830903071288
  },
  "authorsAuthorsForBook GET " : {
    "transaction" : "authorsAuthorsForBook GET ",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 112.52,
    "medianResTime" : 72.5,
    "minResTime" : 4.0,
    "maxResTime" : 488.0,
    "pct1ResTime" : 272.0,
    "pct2ResTime" : 274.95,
    "pct3ResTime" : 486.91999999999945,
    "throughput" : 28.65329512893983,
    "receivedKBytesPerSec" : 7.946812320916905,
    "sentKBytesPerSec" : 5.375291010028653
  }
}