automatedtesting/jmeter/stressreport/statistics.json
{
  "authors POST" : {
    "transaction" : "authors POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 210.23999999999995,
    "medianResTime" : 213.5,
    "minResTime" : 0.0,
    "maxResTime" : 510.0,
    "pct1ResTime" : 350.9,
    "pct2ResTime" : 405.4999999999999,
    "pct3ResTime" : 509.92999999999995,
    "throughput" : 33.23363243602525,
    "receivedKBytesPerSec" : 96.60406800432038,
    "sentKBytesPerSec" : 1.8372616525423728
  },
  "activities DELETE " : {
    "transaction" : "activities DELETE ",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 184.36,
    "medianResTime" : 180.5,
    "minResTime" : 15.0,
    "maxResTime" : 494.0,
    "pct1ResTime" : 324.00000000000006,
    "pct2ResTime" : 369.6499999999999,
    "pct3ResTime" : 493.77999999999986,
    "throughput" : 41.067761806981515,
    "receivedKBytesPerSec" : 118.8590862422998,
    "sentKBytesPerSec" : 2.070633341889117
  },
  "users DELETE" : {
    "transaction" : "users DELETE",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 112.09000000000007,
    "medianResTime" : 67.5,
    "minResTime" : 0.0,
    "maxResTime" : 2234.0,
    "pct1ResTime" : 209.90000000000006,
    "pct2ResTime" : 260.39999999999986,
    "pct3ResTime" : 2217.9499999999916,
    "throughput" : 20.88118605136772,
    "receivedKBytesPerSec" : 55.79395815932345,
    "sentKBytesPerSec" : 2.3564744727500524
  },
  "coverPhotos all GET" : {
    "transaction" : "coverPhotos all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 412.6899999999998,
    "medianResTime" : 198.5,
    "minResTime" : 1.0,
    "maxResTime" : 2220.0,
    "pct1ResTime" : 1851.5000000000002,
    "pct2ResTime" : 1979.6499999999992,
    "pct3ResTime" : 2219.2699999999995,
    "throughput" : 17.421602787456447,
    "receivedKBytesPerSec" : 48.01829268292683,
    "sentKBytesPerSec" : 1.17595818815331
  },
  "coverPhotosCoverPhotosForBook  GET" : {
    "transaction" : "coverPhotosCoverPhotosForBook  GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 391.9099999999999,
    "medianResTime" : 191.0,
    "minResTime" : 1.0,
    "maxResTime" : 2211.0,
    "pct1ResTime" : 1785.4000000000008,
    "pct2ResTime" : 2029.5499999999997,
    "pct3ResTime" : 2210.92,
    "throughput" : 17.51006828926633,
    "receivedKBytesPerSec" : 47.481525509980735,
    "sentKBytesPerSec" : 1.6010426698476623
  },
  "authors all GET" : {
    "transaction" : "authors all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 242.07000000000005,
    "medianResTime" : 252.5,
    "minResTime" : 4.0,
    "maxResTime" : 570.0,
    "pct1ResTime" : 418.8,
    "pct2ResTime" : 451.95,
    "pct3ResTime" : 569.2299999999996,
    "throughput" : 34.50655624568668,
    "receivedKBytesPerSec" : 100.5448261732229,
    "sentKBytesPerSec" : 1.330389492753623
  },
  "authors DELETE" : {
    "transaction" : "authors DELETE",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 248.83000000000004,
    "medianResTime" : 252.5,
    "minResTime" : 1.0,
    "maxResTime" : 530.0,
    "pct1ResTime" : 382.80000000000007,
    "pct2ResTime" : 434.5999999999999,
    "pct3ResTime" : 529.8299999999999,
    "throughput" : 29.036004645760745,
    "receivedKBytesPerSec" : 85.64005108522068,
    "sentKBytesPerSec" : 0.8421575566202091
  },
  "users all GET" : {
    "transaction" : "users all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 153.03000000000003,
    "medianResTime" : 97.0,
    "minResTime" : 0.0,
    "maxResTime" : 2159.0,
    "pct1ResTime" : 227.20000000000005,
    "pct2ResTime" : 274.94999999999976,
    "pct3ResTime" : 2157.229999999999,
    "throughput" : 18.72308556450103,
    "receivedKBytesPerSec" : 49.60429197481745,
    "sentKBytesPerSec" : 2.0405237783186667
  },
  "books PUT" : {
    "transaction" : "books PUT",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 252.20999999999995,
    "medianResTime" : 234.5,
    "minResTime" : 51.0,
    "maxResTime" : 1947.0,
    "pct1ResTime" : 360.9000000000001,
    "pct2ResTime" : 388.74999999999994,
    "pct3ResTime" : 1931.6699999999921,
    "throughput" : 17.946877243359655,
    "receivedKBytesPerSec" : 53.112941941852114,
    "sentKBytesPerSec" : 0.9639436019382628
  },
  "books POST" : {
    "transaction" : "books POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 377.51,
    "medianResTime" : 244.5,
    "minResTime" : 0.0,
    "maxResTime" : 2265.0,
    "pct1ResTime" : 446.3000000000003,
    "pct2ResTime" : 1960.35,
    "pct3ResTime" : 2264.94,
    "throughput" : 17.436791630340018,
    "receivedKBytesPerSec" : 50.63906522449869,
    "sentKBytesPerSec" : 1.4209963491717523
  },
  "activities GET" : {
    "transaction" : "activities GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 116.84999999999997,
    "medianResTime" : 106.5,
    "minResTime" : 0.0,
    "maxResTime" : 418.0,
    "pct1ResTime" : 207.8,
    "pct2ResTime" : 317.9999999999998,
    "pct3ResTime" : 417.15999999999957,
    "throughput" : 60.64281382656155,
    "receivedKBytesPerSec" : 168.229324590661,
    "sentKBytesPerSec" : 2.7449164266221953
  },
  "activities PUT " : {
    "transaction" : "activities PUT ",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 169.81999999999996,
    "medianResTime" : 159.0,
    "minResTime" : 4.0,
    "maxResTime" : 493.0,
    "pct1ResTime" : 305.5,
    "pct2ResTime" : 336.84999999999997,
    "pct3ResTime" : 492.50999999999976,
    "throughput" : 48.61448711716091,
    "receivedKBytesPerSec" : 140.70096013612056,
    "sentKBytesPerSec" : 3.6831171001458434
  },
  "authors PUT" : {
    "transaction" : "authors PUT",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 218.51,
    "medianResTime" : 233.5,
    "minResTime" : 0.0,
    "maxResTime" : 415.0,
    "pct1ResTime" : 362.5,
    "pct2ResTime" : 386.34999999999985,
    "pct3ResTime" : 414.96,
    "throughput" : 30.84515731030228,
    "receivedKBytesPerSec" : 89.84856955582974,
    "sentKBytesPerSec" : 1.3241729642196176
  },
  "books GET" : {
    "transaction" : "books GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 238.69999999999996,
    "medianResTime" : 239.5,
    "minResTime" : 0.0,
    "maxResTime" : 482.0,
    "pct1ResTime" : 335.6,
    "pct2ResTime" : 418.2999999999996,
    "pct3ResTime" : 481.90999999999997,
    "throughput" : 28.61230329041488,
    "receivedKBytesPerSec" : 84.57701850858369,
    "sentKBytesPerSec" : 0.6834540414878397
  },
  "books DELETE" : {
    "transaction" : "books DELETE",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 497.34999999999997,
    "medianResTime" : 235.0,
    "minResTime" : 0.0,
    "maxResTime" : 2257.0,
    "pct1ResTime" : 1918.0,
    "pct2ResTime" : 2067.0499999999993,
    "pct3ResTime" : 2255.5699999999993,
    "throughput" : 17.602534765006162,
    "receivedKBytesPerSec" : 49.44352611776096,
    "sentKBytesPerSec" : 1.119583094965675
  },
  "coverPhotos POST" : {
    "transaction" : "coverPhotos POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 199.0799999999999,
    "medianResTime" : 126.0,
    "minResTime" : 21.0,
    "maxResTime" : 2022.0,
    "pct1ResTime" : 288.80000000000007,
    "pct2ResTime" : 440.549999999999,
    "pct3ResTime" : 2020.119999999999,
    "throughput" : 17.238407171177382,
    "receivedKBytesPerSec" : 45.84658760343044,
    "sentKBytesPerSec" : 2.8918101404930185
  },
  "users PUT" : {
    "transaction" : "users PUT",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 166.82999999999998,
    "medianResTime" : 85.0,
    "minResTime" : 0.0,
    "maxResTime" : 2189.0,
    "pct1ResTime" : 246.80000000000007,
    "pct2ResTime" : 360.6499999999999,
    "pct3ResTime" : 2188.2099999999996,
    "throughput" : 19.904458598726112,
    "receivedKBytesPerSec" : 52.330454443670384,
    "sentKBytesPerSec" : 3.1481700338375798
  },
  "users POST" : {
    "transaction" : "users POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 159.95000000000007,
    "medianResTime" : 86.5,
    "minResTime" : 1.0,
    "maxResTime" : 1904.0,
    "pct1ResTime" : 250.70000000000013,
    "pct2ResTime" : 421.549999999999,
    "pct3ResTime" : 1903.5299999999997,
    "throughput" : 19.916351324437365,
    "receivedKBytesPerSec" : 52.82617693188608,
    "sentKBytesPerSec" : 3.2155960590519816
  },
  "authors GET" : {
    "transaction" : "authors GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 196.70999999999995,
    "medianResTime" : 180.0,
    "minResTime" : 0.0,
    "maxResTime" : 473.0,
    "pct1ResTime" : 343.70000000000005,
    "pct2ResTime" : 401.84999999999974,
    "pct3ResTime" : 472.88999999999993,
    "throughput" : 37.993920972644375,
    "receivedKBytesPerSec" : 109.56534063924772,
    "sentKBytesPerSec" : 1.4815402973024316
  },
  "users GET" : {
    "transaction" : "users GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 148.88999999999996,
    "medianResTime" : 86.0,
    "minResTime" : 0.0,
    "maxResTime" : 2105.0,
    "pct1ResTime" : 239.60000000000002,
    "pct2ResTime" : 303.79999999999995,
    "pct3ResTime" : 2104.3299999999995,
    "throughput" : 19.743336623889437,
    "receivedKBytesPerSec" : 51.90318824037512,
    "sentKBytesPerSec" : 2.0666877467917075
  },
  "activities POST" : {
    "transaction" : "activities POST",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 192.73999999999998,
    "medianResTime" : 197.0,
    "minResTime" : 3.0,
    "maxResTime" : 469.0,
    "pct1ResTime" : 402.00000000000006,
    "pct2ResTime" : 436.84999999999997,
    "pct3ResTime" : 468.96,
    "throughput" : 54.67468562055768,
    "receivedKBytesPerSec" : 158.24050027337344,
    "sentKBytesPerSec" : 4.1278319778567525
  },
  "coverPhotos GET" : {
    "transaction" : "coverPhotos GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 350.7299999999999,
    "medianResTime" : 188.0,
    "minResTime" : 1.0,
    "maxResTime" : 2242.0,
    "pct1ResTime" : 421.40000000000015,
    "pct2ResTime" : 2109.9499999999994,
    "pct3ResTime" : 2241.0499999999997,
    "throughput" : 17.89228842368939,
    "receivedKBytesPerSec" : 49.44841429593845,
    "sentKBytesPerSec" : 1.3903216697978171
  },
  "books all GET" : {
    "transaction" : "books all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 257.69,
    "medianResTime" : 251.0,
    "minResTime" : 8.0,
    "maxResTime" : 510.0,
    "pct1ResTime" : 408.9000000000001,
    "pct2ResTime" : 444.9,
    "pct3ResTime" : 509.9,
    "throughput" : 29.65599051008304,
    "receivedKBytesPerSec" : 87.76551379003558,
    "sentKBytesPerSec" : 0.7541425711743772
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2700,
    "errorCount" : 2700,
    "errorPct" : 100.0,
    "meanResTime" : 278.7118518518526,
    "medianResTime" : 174.0,
    "minResTime" : 0.0,
    "maxResTime" : 3240.0,
    "pct1ResTime" : 377.0,
    "pct2ResTime" : 998.6999999999989,
    "pct3ResTime" : 2671.6199999999917,
    "throughput" : 236.19980754089755,
    "receivedKBytesPerSec" : 661.2785578962909,
    "sentKBytesPerSec" : 19.19456617421923
  },
  "coverPhotos DELETE" : {
    "transaction" : "coverPhotos DELETE",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 176.15000000000003,
    "medianResTime" : 118.0,
    "minResTime" : 1.0,
    "maxResTime" : 2297.0,
    "pct1ResTime" : 267.3000000000002,
    "pct2ResTime" : 303.9,
    "pct3ResTime" : 2295.5599999999995,
    "throughput" : 18.433179723502302,
    "receivedKBytesPerSec" : 48.77196140552996,
    "sentKBytesPerSec" : 2.294786866359447
  },
  "coverPhotos PUT" : {
    "transaction" : "coverPhotos PUT",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 459.53000000000003,
    "medianResTime" : 161.0,
    "minResTime" : 1.0,
    "maxResTime" : 2192.0,
    "pct1ResTime" : 1958.6000000000001,
    "pct2ResTime" : 2065.2,
    "pct3ResTime" : 2191.96,
    "throughput" : 17.522340984755562,
    "receivedKBytesPerSec" : 46.25744015025408,
    "sentKBytesPerSec" : 2.9098379731032065
  },
  "activities all GET" : {
    "transaction" : "activities all GET",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 1208.33,
    "medianResTime" : 743.5,
    "minResTime" : 23.0,
    "maxResTime" : 3240.0,
    "pct1ResTime" : 3226.6,
    "pct2ResTime" : 3230.95,
    "pct3ResTime" : 3239.94,
    "throughput" : 23.277467411545622,
    "receivedKBytesPerSec" : 62.302232454608934,
    "sentKBytesPerSec" : 2.5182400779795158
  },
  "authorsAuthorsForBook GET " : {
    "transaction" : "authorsAuthorsForBook GET ",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 182.42000000000002,
    "medianResTime" : 174.0,
    "minResTime" : 3.0,
    "maxResTime" : 427.0,
    "pct1ResTime" : 316.0,
    "pct2ResTime" : 343.84999999999997,
    "pct3ResTime" : 426.81999999999994,
    "throughput" : 42.3728813559322,
    "receivedKBytesPerSec" : 122.63638771186442,
    "sentKBytesPerSec" : 1.9080210540254239
  }
}